tutorials/combustion/PDRFoam/FlamePropagationWithObstacles/system/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dictionaryReplacement
{
    p
    {
        boundaryField
        {
            blockedFaces
            {
                type        zeroGradient;
            }
            baffleWall
            {
                type        zeroGradient;
            }
            baffleCyclic_half0
            {
                type        cyclic;
            }
            baffleCyclic_half1
            {
                type        cyclic;
            }

        }
    }

    U
    {
        boundaryField
        {
            blockedFaces
            {
                type            fixedValue;
                value           uniform (0 0 0);
            }
            baffleWall
            {
                type                activePressureForceBaffleVelocity;
                cyclicPatch         baffleCyclic_half0;
                orientation         1;
                openingTime         0.01;
                maxOpenFractionDelta 0.1;
                openFraction        0;
                p                   p;
                minThresholdValue   8000;
                forceBased          0;
                value               uniform ( 0 0 0 );
            }
            baffleCyclic_half0
            {
                type        cyclic;
            }
            baffleCyclic_half1
            {
                type        cyclic;
            }
        }
    }

    epsilon
    {
        boundaryField
        {
            blockedFaces
            {
                type            compressible::epsilonWallFunction;
                value           uniform 0.1;
            }
            baffleWall
            {
                type            compressible::epsilonWallFunction;
                value           uniform 1e-5;
            }
            baffleCyclic_half0
            {
                type        cyclic;
            }
            baffleCyclic_half1
            {
                type        cyclic;
            }
        }
    }

    k
    {
        boundaryField
        {
            blockedFaces
            {
                type        compressible::kqRWallFunction;
                value       uniform 1.5;
         }
            baffleWall
            {
                type         compressible::kqRWallFunction;
                value           uniform 1.5;
            }
            baffleCyclic_half0
            {
                type        cyclic;
            }
            baffleCyclic_half1
            {
                type        cyclic;
            }
        }
    }

    Su
    {
        boundaryField
        {
            blockedFaces
            {
                type        zeroGradient;
            }
            baffleWall
            {
                type        zeroGradient;
            }
            baffleCyclic_half0
            {
                type        cyclic;
            }
            baffleCyclic_half1
            {
                type        cyclic;
            }
        }
    }

    Xi
    {
        boundaryField
        {
            blockedFaces
            {
                type        zeroGradient;
            }
             baffleWall
            {
                type        zeroGradient;
                value       uniform 1;
            }
            baffleCyclic_half0
            {
                type        cyclic;
            }
            baffleCyclic_half1
            {
                type        cyclic;
            }
        }
    }

    T
    {
        boundaryField
        {
            blockedFaces
            {
                type        zeroGradient;
            }
            baffleWall
            {
                type        zeroGradient;
                value       uniform 300;
            }
            baffleCyclic_half0
            {
                type        cyclic;
            }
            baffleCyclic_half1
            {
                type        cyclic;
            }
        }
    }

    Tu
    {
        boundaryField
        {
            blockedFaces
            {
                type        zeroGradient;
            }
            baffleWall
            {
                type        zeroGradient;
                value       uniform 300;
            }
            baffleCyclic_half0
            {
                type        cyclic;
            }
            baffleCyclic_half1
            {
                type        cyclic;
            }
        }
    }

    b
    {
        boundaryField
        {
            blockedFaces
            {
                type        zeroGradient;
            }
            baffleWall
            {
                type        zeroGradient;
                value       uniform 1;
            }
            baffleCyclic_half0
            {
                type        cyclic;
            }
            baffleCyclic_half1
            {
                type        cyclic;
            }
        }
    }

    ft
    {
        boundaryField
        {
            blockedFaces
            {
                type        zeroGradient;
            }
            baffleWall
            {
                type        zeroGradient;
                value       uniform 0.06024096;
            }
            baffleCyclic_half0
            {
                type        cyclic;
            }
            baffleCyclic_half1
            {
                type        cyclic;
            }
        }
    }

    Aw
    {
        boundaryField
        {
            blockedFaces
            {
                type        zeroGradient;
            }
             baffleWall
            {
                type        zeroGradient;
                value       uniform 0.0;
            }
            baffleCyclic_half0
            {
                type        cyclic;
            }
            baffleCyclic_half1
            {
                type        cyclic;
            }
        }
    }
    B
    {
        boundaryField
        {
            blockedFaces
            {
                type        zeroGradient;
            }
            baffleWall
            {
                type        zeroGradient;
                value       uniform (0 0 0 0 0 0);
            }
            baffleCyclic_half0
            {
                type        cyclic;
            }
            baffleCyclic_half1
            {
                type        cyclic;
            }
        }
    }
    betav
    {
        boundaryField
        {
            blockedFaces
            {
                type        zeroGradient;
            }
            baffleWall
            {
                type        zeroGradient;
                value       uniform 0;
            }
            baffleCyclic_half0
            {
                type        cyclic;
            }
            baffleCyclic_half1
            {
                type        cyclic;
            }
        }
    }
    CR
    {
        boundaryField
        {
            blockedFaces
            {
                type        zeroGradient;
            }
            baffleWall
            {
                type        zeroGradient;
                value       uniform (0 0 0 0 0 0);
            }
            baffleCyclic_half0
            {
                type        cyclic;
            }
            baffleCyclic_half1
            {
                type        cyclic;
            }
        }
    }
    CT
    {
        boundaryField
        {
            blockedFaces
            {
                type        zeroGradient;
            }
            baffleWall
            {
                type        zeroGradient;
                value       uniform (0 0 0 0 0 0);
            }
            baffleCyclic_half0
            {
                type        cyclic;
            }
            baffleCyclic_half1
            {
                type        cyclic;
            }
        }
    }
    Nv
    {
        boundaryField
        {
            blockedFaces
            {
                type        zeroGradient;
            }
            baffleWall
            {
                type        zeroGradient;
                value       uniform 0;
            }
            baffleCyclic_half0
            {
                type        cyclic;
            }
            baffleCyclic_half1
            {
                type        cyclic;
            }
        }
    }
    nsv
    {
        boundaryField
        {
            blockedFaces
            {
                type        zeroGradient;
            }
            baffleWall
            {
                type        zeroGradient;
                value       uniform (0 0 0 0 0 0);
            }
            baffleCyclic_half0
            {
                type        cyclic;
            }
            baffleCyclic_half1
            {
                type        cyclic;
            }
        }
    }
    Lobs
    {
        boundaryField
        {
            blockedFaces
            {
                type        zeroGradient;
            }
            baffleWall
            {
                type        zeroGradient;
                value       uniform 0;
            }
            baffleCyclic_half0
            {
                type        cyclic;
            }
            baffleCyclic_half1
            {
                type        cyclic;
            }
        }
    }
}

// ************************************************************************* //
